# Working with missing data

In [4]:
import numpy as np
import pandas as pd

In [6]:
df = pd.DataFrame({'A': [1, 2, np.nan],
                   'B': [4, np.nan, np.nan],
                   'C': [7, 8, 9]})
df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [7]:
df.loc[2, 'A']

nan

In [8]:
np.nan

nan

In [11]:
df['A'].mean()

1.5

In [13]:
df['A'].mean(skipna=False)

nan

In [15]:
df['A'] + 3

0    4.0
1    5.0
2    NaN
Name: A, dtype: float64

In [17]:
df['A'] == np.nan

0    False
1    False
2    False
Name: A, dtype: bool

In [16]:
df['A'].isna() # .isnull()

0    False
1    False
2     True
Name: A, dtype: bool

In [18]:
np.nan == np.nan

False

In [19]:
df['A'].notna()

0     True
1     True
2    False
Name: A, dtype: bool

In [21]:
df['A'].isna().sum()

1

In [23]:
df.isna().sum()

A    1
B    2
C    0
dtype: int64

In [24]:
df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [25]:
df.dropna()

     A    B  C
0  1.0  4.0  7

In [26]:
df.dropna(subset=['A', 'C'])

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8

In [28]:
df.fillna()

     A    B  C
0  1.0  4.0  7
1  2.0 -1.0  8
2 -1.0 -1.0  9

In [ ]:
df.interpolate()

Summary:

* missing value indicator: `np.nan` (`NaN`)
* Reductions: skip by default
* Mathematical operations (eg `+`): propagate by default
* Specific functions:
    * `isna`, `notna`
    * `dropna`
    * `fillna`, `interpolate`

In [49]:
df = pd.read_csv("../data/titanic.csv")

In [50]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S